app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all
---
SELECT * FROM `recipes`

  def show
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 0)

  def edit
    @recipe = Recipe.find(params[:id])
---
SELECT * FROM `recipes` WHERE (`recipes`.`id` = 1)